feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
#include "motor_test.h"

#include <Arduino.h>
#include <SimpleFOC.h>

#include "config.h"
#include "configurable_hall_sensor.h"

extern "C" {
#include "stm32g4xx_hal.h"
#include "stm32g4xx_hal_spi.h"
}

namespace motor_test {

namespace {

float rpmToRadPerSec(float rpm) {
  return rpm * 0.104719755f;
}

uint16_t readU16Be(const uint8_t* data) {
  return static_cast<uint16_t>((static_cast<uint16_t>(data[0]) << 8) | data[1]);
}

struct DrvRegisters {
  uint16_t status1 = 0;
  uint16_t status2 = 0;
  uint16_t control1 = 0;
  uint16_t control2 = 0;
  bool frame_fault = false;
  bool spi_ok = false;
  bool control_match = false;
};

SPI_HandleTypeDef g_hspi1 = {};
DrvRegisters g_drv = {};
BLDCMotor g_motor(config::kConfiguredPolePairs);
BLDCDriver3PWM g_driver3(config::kPwmAPin, config::kPwmBPin, config::kPwmCPin);
BLDCDriver6PWM g_driver6(config::kPwmAPin, config::kPwmALowPin, config::kPwmBPin,
                         config::kPwmBLowPin, config::kPwmCPin, config::kPwmCLowPin);
ConfigurableHallSensor g_hall_sensor(config::kHallAPin, config::kHallBPin, config::kHallCPin,
                                     config::kConfiguredPolePairs,
                                     config::kSimpleFocClosedloopHallSectorOffset);

struct StepPattern {
  uint8_t pwm_a;
  uint8_t pwm_b;
  uint8_t pwm_c;
  const char* label;
};

constexpr StepPattern kForwardSteps[6] = {
    {config::kSixStepPwmDuty, 0, 0, "A+"},
    {config::kSixStepPwmDuty, config::kSixStepPwmDuty, 0, "A+B+"},
    {0, config::kSixStepPwmDuty, 0, "B+"},
    {0, config::kSixStepPwmDuty, config::kSixStepPwmDuty, "B+C+"},
    {0, 0, config::kSixStepPwmDuty, "C+"},
    {config::kSixStepPwmDuty, 0, config::kSixStepPwmDuty, "A+C+"},
};

constexpr uint8_t kHallSequence[6] = {0b001, 0b101, 0b100, 0b110, 0b010, 0b011};
constexpr uint8_t kDrvRegStatus1 = 0x00u;
constexpr uint8_t kDrvRegStatus2 = 0x01u;
constexpr uint8_t kDrvRegControl1 = 0x02u;
constexpr uint8_t kDrvRegControl2 = 0x03u;

enum Drv8301Control1Bits : uint16_t {
  kCtrl1GateCurrentShift = 0,
  kCtrl1GateResetBit = 2,
  kCtrl1PwmModeBit = 3,
  kCtrl1OcpModeShift = 4,
  kCtrl1OcAdjShift = 6,
};

enum Drv8301Control2Bits : uint16_t {
  kCtrl2OcToffBit = 0,
  kCtrl2DcCalCh2Bit = 1,
  kCtrl2DcCalCh1Bit = 2,
  kCtrl2GainShift = 3,
  kCtrl2OctwModeShift = 5,
};

bool g_driver_enabled = false;
bool g_drv_configured = false;
bool g_fault_latched = false;
bool g_openloop_started = false;
bool g_openloop_debug_started = false;
bool g_closedloop_started = false;
bool g_closedloop_startup_active = false;
bool g_drv_spi_stage_pwm = false;
bool g_sixstep_startup_active = false;
uint8_t g_step_index = 0;
uint8_t g_last_hall_state = 0xFF;
uint32_t g_boot_ms = 0;
uint32_t g_last_print_ms = 0;
uint32_t g_last_phase_change_ms = 0;
uint32_t g_sixstep_enable_ms = 0;
uint32_t g_sixstep_last_kick_ms = 0;
uint32_t g_closedloop_enable_ms = 0;
uint32_t g_openloop_enable_ms = 0;
uint32_t g_openloop_last_good_drv_ms = 0;
uint32_t g_openloop_debug_step_ms = 0;
uint32_t g_openloop_step_interval_ms = 0;
float g_openloop_debug_angle_el = 0.0f;
float g_openloop_debug_voltage = 0.0f;
float g_openloop_target_rad_s = 0.0f;
bool g_openloop_move_called = false;
uint8_t g_sixstep_current_duty = config::kSixStepPwmDuty;
bool g_closedloop_loopfoc_called = false;
bool g_closedloop_move_called = false;
bool g_closedloop_initfoc_started = false;
bool g_closedloop_initfoc_done = false;
bool g_closedloop_handoff_allowed = false;
bool g_closedloop_handoff_evaluated = false;
float g_closedloop_startup_target_rad_s = 0.0f;
float g_closedloop_measured_rad_s_at_handoff = 0.0f;
uint32_t g_closedloop_startup_phase_ms = 0;
uint32_t g_closedloop_stall_since_ms = 0;
bool g_closedloop_recovery_active = false;
uint32_t g_closedloop_recovery_count = 0;
uint32_t g_closedloop_startup_forward_events = 0;
uint32_t g_closedloop_startup_reverse_events = 0;
uint32_t g_closedloop_startup_jump_events = 0;
int32_t g_closedloop_hall_forward_count = 0;
int32_t g_closedloop_hall_reverse_count = 0;
int32_t g_closedloop_hall_jump_count = 0;
int32_t g_closedloop_hall_invalid_count = 0;
int8_t g_closedloop_last_hall_idx = -1;
int8_t g_closedloop_hall_delta = 0;
volatile uint32_t hall_a_irq_count = 0;
volatile uint32_t hall_b_irq_count = 0;
volatile uint32_t hall_c_irq_count = 0;
uint32_t g_last_hall_a_irq_count = 0;
uint32_t g_last_hall_b_irq_count = 0;
uint32_t g_last_hall_c_irq_count = 0;
uint32_t g_hall_a_irq_delta = 0;
uint32_t g_hall_b_irq_delta = 0;
uint32_t g_hall_c_irq_delta = 0;
float g_last_sensor_angle = 0.0f;
float g_last_sensor_velocity = 0.0f;
bool g_sensor_angle_changes = false;
bool g_sensor_velocity_valid = false;
bool g_hall_irq_counts_increasing = false;
int32_t g_closedloop_stall_sector_counts[6] = {0, 0, 0, 0, 0, 0};
int8_t g_closedloop_last_stall_sector = -1;
float g_closedloop_last_stall_measured_rad_s = 0.0f;
float g_closedloop_last_stall_raw_sensor_rad_s = 0.0f;
bool g_closedloop_stall_detected = false;
bool g_closedloop_raw_zero_detected = false;

void printState(Stream& serial, const char* reason);
bool isValidHallState(uint8_t hall);
int8_t hallIndex(uint8_t hall);

bool isClosedloop6PwmMode() {
  return config::kTestMode == config::TEST_SIMPLEFOC_CLOSEDLOOP_6PWM;
}

bool isPhaseCheck6PwmMode() {
  return config::kTestMode == config::TEST_PHASE_CHECK_6PWM;
}

bool isRawCPinsMode() {
  return config::kTestMode == config::TEST_RAW_C_PINS;
}

bool isPhaseCheck3PwmMode() {
  return config::kTestMode == config::TEST_PHASE_CHECK_3PWM;
}

bool isRaw3PwmPinsMode() {
  return config::kTestMode == config::TEST_RAW_3PWM_PINS;
}

bool uses6PwmDriverMode() {
  return isClosedloop6PwmMode() || isPhaseCheck6PwmMode();
}

const char* closedloopDriverType() {
  return isClosedloop6PwmMode() ? "BLDCDriver6PWM" : "BLDCDriver3PWM";
}

float closedloopMeasuredRadS() {
  return g_motor.shaft_velocity;
}

float closedloopRawSensorRadS() {
  return g_hall_sensor.getVelocity();
}

int8_t closedloopHallSectorOffset() {
  return g_hall_sensor.getSectorOffset();
}

float closedloopTargetRadS() {
  return rpmToRadPerSec(config::kSimpleFocClosedloopTargetRpm) *
         (config::kSimpleFocClosedloopReverse ? -1.0f : 1.0f);
}

void recordClosedloopHallTransition(uint8_t prev_hall, uint8_t next_hall) {
  const int8_t prev_idx = hallIndex(prev_hall);
  const int8_t next_idx = hallIndex(next_hall);
  g_closedloop_last_hall_idx = next_idx;

  if (!isValidHallState(next_hall) || prev_idx < 0 || next_idx < 0) {
    ++g_closedloop_hall_invalid_count;
    g_closedloop_hall_delta = 0;
    return;
  }

  const int8_t forward_delta = static_cast<int8_t>((next_idx - prev_idx + 6) % 6);
  if (forward_delta == 1) {
    ++g_closedloop_hall_forward_count;
    ++g_closedloop_startup_forward_events;
    g_closedloop_hall_delta = 1;
  } else if (forward_delta == 5) {
    ++g_closedloop_hall_reverse_count;
    ++g_closedloop_startup_reverse_events;
    g_closedloop_hall_delta = -1;
  } else {
    ++g_closedloop_hall_jump_count;
    ++g_closedloop_startup_jump_events;
    g_closedloop_hall_delta = forward_delta;
  }
}

void resetClosedloopStallTracking() {
  for (int index = 0; index < 6; ++index) {
    g_closedloop_stall_sector_counts[index] = 0;
  }
  g_closedloop_last_stall_sector = -1;
  g_closedloop_last_stall_measured_rad_s = 0.0f;
  g_closedloop_last_stall_raw_sensor_rad_s = 0.0f;
  g_closedloop_stall_detected = false;
  g_closedloop_raw_zero_detected = false;
}

void updateClosedloopStallTracking(uint8_t hall, float target_rad_s, float measured_rad_s,
                                   float raw_sensor_rad_s) {
  const int8_t hall_idx = hallIndex(hall);
  const float stall_limit = fabsf(target_rad_s) * config::kSimpleFocClosedloopStallDetectRatio;
  g_closedloop_raw_zero_detected =
      fabsf(raw_sensor_rad_s) <= config::kSimpleFocClosedloopRawZeroEpsilon;
  g_closedloop_stall_detected = fabsf(measured_rad_s) < stall_limit;
  if (g_closedloop_stall_detected && hall_idx >= 0) {
    ++g_closedloop_stall_sector_counts[hall_idx];
    g_closedloop_last_stall_sector = hall_idx;
    g_closedloop_last_stall_measured_rad_s = measured_rad_s;
    g_closedloop_last_stall_raw_sensor_rad_s = raw_sensor_rad_s;
  }
}

void startClosedloopStartupPhase(uint32_t now, float target_rad_s, bool recovery_active) {
  g_closedloop_startup_active = true;
  g_closedloop_recovery_active = recovery_active;
  g_closedloop_startup_phase_ms = now;
  g_closedloop_handoff_allowed = false;
  g_closedloop_handoff_evaluated = false;
  g_closedloop_measured_rad_s_at_handoff = 0.0f;
  g_closedloop_startup_forward_events = 0;
  g_closedloop_startup_reverse_events = 0;
  g_closedloop_startup_jump_events = 0;
  g_closedloop_startup_target_rad_s =
      rpmToRadPerSec(recovery_active ? config::kSimpleFocClosedloopRecoveryRpm
                                     : config::kSimpleFocClosedloopStartupRpm) *
      ((target_rad_s >= 0.0f) ? 1.0f : -1.0f);
  g_motor.controller = MotionControlType::velocity_openloop;
}

bool closedloopHandoffReady(float target_rad_s, float measured_rad_s, float raw_sensor_rad_s) {
  const float handoff_limit = fabsf(target_rad_s) * 1.5f;
  return fabsf(measured_rad_s) <= handoff_limit &&
         fabsf(raw_sensor_rad_s) >= config::kSimpleFocClosedloopHandoffMinRawSensorRadS &&
         g_closedloop_startup_forward_events >=
             config::kSimpleFocClosedloopHandoffMinForwardTransitions &&
         g_closedloop_startup_reverse_events == 0u && g_closedloop_startup_jump_events == 0u;
}

void advanceOpenloopAngleStep() {
  g_openloop_debug_angle_el += config::kSimpleFocOpenloopDebugStepDeg * DEG_TO_RAD;
  if (g_openloop_debug_angle_el >= _2PI) {
    g_openloop_debug_angle_el -= _2PI;
  }
}

uint32_t openloopStepIntervalMsForRpm(float rpm) {
  const float clamped_rpm = max(1.0f, rpm);
  const float step_rad = config::kSimpleFocOpenloopDebugStepDeg * DEG_TO_RAD;
  const float electrical_rad_per_sec =
      rpmToRadPerSec(clamped_rpm) * static_cast<float>(config::kConfiguredPolePairs);
  const float interval_ms = (step_rad / electrical_rad_per_sec) * 1000.0f;
  return static_cast<uint32_t>(max(20.0f, min(200.0f, interval_ms)));
}

bool faultActive() {
  return digitalRead(config::kDrvFaultPin) == LOW;
}

void doHallA() {
  ++hall_a_irq_count;
  g_hall_sensor.handleA();
}

void doHallB() {
  ++hall_b_irq_count;
  g_hall_sensor.handleB();
}

void doHallC() {
  ++hall_c_irq_count;
  g_hall_sensor.handleC();
}

uint16_t buildDrvControl1(bool gate_reset) {
  uint16_t value = 0;
  value |= static_cast<uint16_t>((config::kDrvGateCurrentCode & 0x03u) << kCtrl1GateCurrentShift);
  value |= static_cast<uint16_t>((config::kDrvOcpModeCode & 0x03u) << kCtrl1OcpModeShift);
  value |= static_cast<uint16_t>((config::kDrvOcpAdjustCode & 0x1Fu) << kCtrl1OcAdjShift);
  if (!uses6PwmDriverMode() && config::kDrvUse3PwmMode) {
    value |= static_cast<uint16_t>(1u << kCtrl1PwmModeBit);
  }
  if (gate_reset) {
    value |= static_cast<uint16_t>(1u << kCtrl1GateResetBit);
  }
  return value;
}

uint16_t buildDrvControl2() {
  uint16_t value = 0;
  if (config::kDrvOcToff) {
    value |= static_cast<uint16_t>(1u << kCtrl2OcToffBit);
  }
  if (config::kDrvDcCalCh2) {
    value |= static_cast<uint16_t>(1u << kCtrl2DcCalCh2Bit);
  }
  if (config::kDrvDcCalCh1) {
    value |= static_cast<uint16_t>(1u << kCtrl2DcCalCh1Bit);
  }
  value |= static_cast<uint16_t>((config::kDrvShuntGainCode & 0x03u) << kCtrl2GainShift);
  value |= static_cast<uint16_t>((config::kDrvOctwModeCode & 0x03u) << kCtrl2OctwModeShift);
  return value;
}

