feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
void beginSimpleFocOpenloop(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  digitalWrite(config::kDrvEnablePin, LOW);

  g_fault_latched = false;
  g_driver_enabled = false;
  g_openloop_started = false;
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_openloop_enable_ms = 0;
  g_openloop_last_good_drv_ms = 0;
  g_openloop_target_rad_s = 0.0f;
  g_openloop_move_called = false;
  g_drv_configured = false;
  g_drv = {};
  pwmOff();
  const bool spi_ok = drvSpiInit();

  g_driver3.pwm_frequency = 20000;
  g_driver3.voltage_power_supply = config::kBusVoltage;
  g_driver3.voltage_limit = config::kSimpleFocOpenloopVoltageLimit;
  g_driver3.init();

  g_motor.linkDriver(&g_driver3);
  g_motor.torque_controller = TorqueControlType::voltage;
  g_motor.controller = MotionControlType::velocity_openloop;
  g_motor.foc_modulation = FOCModulationType::Trapezoid_120;
  g_motor.voltage_limit = config::kSimpleFocOpenloopVoltageLimit;
  g_motor.velocity_limit = rpmToRadPerSec(config::kSimpleFocOpenloopTargetRpm);
  g_motor.init();

  serial.println("SimpleFOC 3PWM open-loop test");
  serial.println("Driver starts disabled, then DRV8301 is configured over SPI.");
  serial.print("Enable delay ms=");
  serial.print(config::kSimpleFocEnableDelayMs);
  serial.print(" target_rpm=");
  serial.print(config::kSimpleFocOpenloopTargetRpm, 1);
  serial.print(" voltage_limit=");
  serial.println(config::kSimpleFocOpenloopVoltageLimit, 2);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  printState(serial, "boot");
}

void beginSimpleFocOpenloopDebug(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  digitalWrite(config::kDrvEnablePin, LOW);

  g_fault_latched = false;
  g_driver_enabled = false;
  g_openloop_debug_started = false;
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_openloop_debug_step_ms = 0;
  g_openloop_debug_angle_el = 0.0f;
  g_openloop_debug_voltage = config::kSimpleFocOpenloopDebugVoltage;
  g_drv = {};
  pwmOff();
  const bool spi_ok = drvSpiInit();

  g_driver3.pwm_frequency = 20000;
  g_driver3.voltage_power_supply = config::kBusVoltage;
  g_driver3.voltage_limit = config::kSimpleFocOpenloopDebugVoltage;
  g_driver3.init();

  g_motor.linkDriver(&g_driver3);
  g_motor.torque_controller = TorqueControlType::voltage;
  g_motor.controller = MotionControlType::angle_openloop;
  g_motor.foc_modulation = FOCModulationType::Trapezoid_120;
  g_motor.voltage_limit = config::kSimpleFocOpenloopDebugVoltage;
  g_motor.init();

  serial.println("SimpleFOC 3PWM open-loop direct debug");
  serial.println("Driver starts disabled, then direct electrical angle stepping is applied.");
  serial.print("Enable delay ms=");
  serial.print(config::kSimpleFocEnableDelayMs);
  serial.print(" debug_voltage=");
  serial.print(config::kSimpleFocOpenloopDebugVoltage, 2);
  serial.print(" step_deg=");
  serial.print(config::kSimpleFocOpenloopDebugStepDeg, 1);
  serial.print(" step_ms=");
  serial.println(config::kSimpleFocOpenloopDebugStepMs);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  printState(serial, "boot");
}

void beginSimpleFocClosedloop(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  digitalWrite(config::kDrvEnablePin, LOW);

  g_fault_latched = false;
  g_driver_enabled = false;
  g_drv_configured = false;
  g_closedloop_started = false;
  g_closedloop_startup_active = false;
  g_closedloop_loopfoc_called = false;
  g_closedloop_move_called = false;
  g_closedloop_initfoc_started = false;
  g_closedloop_initfoc_done = false;
  g_closedloop_handoff_allowed = false;
  g_closedloop_handoff_evaluated = false;
  g_boot_ms = millis();
  g_closedloop_enable_ms = 0;
  g_last_print_ms = 0;
  g_last_hall_state = readHallState();
  g_closedloop_startup_target_rad_s = 0.0f;
  g_closedloop_measured_rad_s_at_handoff = 0.0f;
  g_closedloop_startup_phase_ms = 0;
  g_closedloop_stall_since_ms = 0;
  g_closedloop_recovery_active = false;
  g_closedloop_recovery_count = 0;
  g_closedloop_startup_forward_events = 0;
  g_closedloop_startup_reverse_events = 0;
  g_closedloop_startup_jump_events = 0;
  g_closedloop_hall_forward_count = 0;
  g_closedloop_hall_reverse_count = 0;
  g_closedloop_hall_jump_count = 0;
  g_closedloop_hall_invalid_count = 0;
  g_closedloop_last_hall_idx = hallIndex(g_last_hall_state);
  g_closedloop_hall_delta = 0;
  hall_a_irq_count = 0;
  hall_b_irq_count = 0;
  hall_c_irq_count = 0;
  g_last_hall_a_irq_count = 0;
  g_last_hall_b_irq_count = 0;
  g_last_hall_c_irq_count = 0;
  g_hall_a_irq_delta = 0;
  g_hall_b_irq_delta = 0;
  g_hall_c_irq_delta = 0;
  g_last_sensor_angle = 0.0f;
  g_last_sensor_velocity = 0.0f;
  g_sensor_angle_changes = false;
  g_sensor_velocity_valid = false;
  g_hall_irq_counts_increasing = false;
  resetClosedloopStallTracking();
  g_drv = {};
  pwmOff();

  const bool spi_ok = drvSpiInit();

  g_hall_sensor.pullup = Pullup::USE_INTERN;
  g_hall_sensor.setSectorOffset(config::kSimpleFocClosedloopHallSectorOffset);
  g_hall_sensor.init();
  g_hall_sensor.enableInterrupts(doHallA, doHallB, doHallC);

  g_driver3.pwm_frequency = 20000;
  g_driver3.voltage_power_supply = config::kBusVoltage;
  g_driver3.voltage_limit = config::kSimpleFocClosedloopVoltageLimit;
  g_driver3.init();

  g_motor.linkDriver(&g_driver3);
  g_motor.linkSensor(&g_hall_sensor);
  g_motor.controller = MotionControlType::velocity;
  g_motor.torque_controller = TorqueControlType::voltage;
  g_motor.foc_modulation = FOCModulationType::Trapezoid_120;
  g_motor.voltage_limit = config::kSimpleFocClosedloopVoltageLimit;
  g_motor.velocity_limit = rpmToRadPerSec(config::kSimpleFocClosedloopVelocityLimit);
  g_motor.PID_velocity.P = config::kSimpleFocClosedloopVelP;
  g_motor.PID_velocity.I = config::kSimpleFocClosedloopVelI;
  g_motor.PID_velocity.D = config::kSimpleFocClosedloopVelD;
  g_motor.PID_velocity.output_ramp = config::kSimpleFocClosedloopVelOutputRamp;
  g_motor.LPF_velocity.Tf = config::kSimpleFocClosedloopVelLpfTf;
  g_motor.motion_downsample = config::kSimpleFocClosedloopMotionDownsample;
  g_motor.voltage_sensor_align = 0.5f;
  g_motor.init();

  // új rész 
  serial.println("SimpleFOC 3PWM closed-loop hall test");
  serial.println("Driver starts disabled, then DRV8301 is configured over SPI.");
  serial.print("Enable delay ms=");
  serial.print(config::kSimpleFocEnableDelayMs);
  serial.print(" target_rpm=");
  serial.print(config::kSimpleFocClosedloopTargetRpm, 1);
  serial.print(" voltage_limit=");
  serial.print(config::kSimpleFocClosedloopVoltageLimit, 2);
  serial.print(" velocity_limit_rpm=");
  serial.print(config::kSimpleFocClosedloopVelocityLimit, 1);
  serial.print(" startup_rpm=");
  serial.print(config::kSimpleFocClosedloopStartupRpm, 1);
  serial.print(" startup_ms=");
  serial.println(config::kSimpleFocClosedloopStartupMs);
  serial.print(" hall_sector_offset=");
  serial.println(config::kSimpleFocClosedloopHallSectorOffset);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  printState(serial, "boot");
}

