feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
void beginDrvSpiStability(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  drvDisable();

  g_fault_latched = false;
  g_driver_enabled = false;
  g_drv_spi_stage_pwm = false;
  g_step_index = 0;
  g_last_hall_state = readHallState();
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;
  g_drv = {};

  const bool spi_ok = drvSpiInit();
  if (spi_ok) {
    (void)drvReadAll();
  }

  serial.println("DRV SPI stability test");
  serial.println("Stage 1: driver enabled, no PWM. Stage 2: low-PWM phase stress.");
  serial.print("Enable delay ms=");
  serial.print(config::kDrvSpiStabilityEnableDelayMs);
  serial.print(" no_pwm_ms=");
  serial.print(config::kDrvSpiStabilityNoPwmMs);
  serial.print(" step_ms=");
  serial.print(config::kDrvSpiStabilityStepMs);
  serial.print(" pwm=");
  serial.println(config::kDrvSpiStabilityPwmDuty);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  printState(serial, "boot");
}

void beginPhaseCheck6Pwm(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  pinMode(config::kPwmALowPin, OUTPUT);
  pinMode(config::kPwmBLowPin, OUTPUT);
  pinMode(config::kPwmCLowPin, OUTPUT);
  drvDisable();

  g_fault_latched = false;
  g_driver_enabled = false;
  g_step_index = 0;
  g_last_hall_state = readHallState();
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;
  g_drv = {};

  const bool spi_ok = drvSpiInit();
  if (spi_ok) {
    (void)drvReadAll();
  }

  serial.println("6PWM phase leg check test");
  serial.println("One half-bridge output at a time with low PWM.");
  serial.print("Enable delay ms=");
  serial.print(config::kPhaseCheckEnableDelayMs);
  serial.print(" hold ms=");
  serial.print(config::kPhaseCheckHoldMs);
  serial.print(" pwm=");
  serial.println(config::kPhaseCheckPwmDuty);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  serial.println("Sequence: A_high, A_low, B_high, B_low, C_high, C_low.");
  printState(serial, "boot");
}

void beginPhaseCheck3Pwm(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  drvDisable();

  g_fault_latched = false;
  g_driver_enabled = false;
  g_step_index = 0;
  g_last_hall_state = readHallState();
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;
  g_drv = {};

  const bool spi_ok = drvSpiInit();
  if (spi_ok) {
    (void)drvReadAll();
  }

  serial.println("3PWM phase check test");
  serial.println("One high-side PWM output at a time with low duty.");
  serial.print("Enable delay ms=");
  serial.print(config::kPhaseCheckEnableDelayMs);
  serial.print(" hold ms=");
  serial.print(config::kPhaseCheckHoldMs);
  serial.print(" pwm=");
  serial.println(config::kPhaseCheckPwmDuty);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  serial.println("Sequence: A_high, B_high, C_high.");
  printState(serial, "boot");
}

void beginRawCPins(Stream& serial) {
  pinMode(config::kPwmCPin, OUTPUT);
  pinMode(config::kPwmCLowPin, OUTPUT);
  analogWrite(config::kPwmCPin, 0);
  analogWrite(config::kPwmCLowPin, 0);

  g_step_index = 0;
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;

  serial.println("Raw C pins PWM test");
  serial.println("No DRV, no SimpleFOC. Direct MCU PWM only.");
  serial.print("pins=PA10,PB15 pwm=");
  serial.print(config::kPhaseCheckPwmDuty);
  serial.print(" hold_ms=");
  serial.println(config::kPhaseCheckHoldMs);
  serial.println("Sequence: PA10_high, then PB15_low.");
  printState(serial, "boot");
}

void beginRaw3PwmPins(Stream& serial) {
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  analogWrite(config::kPwmAPin, 0);
  analogWrite(config::kPwmBPin, 0);
  analogWrite(config::kPwmCPin, 0);

  g_step_index = 0;
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;

  serial.println("Raw 3PWM pins test");
  serial.println("No DRV, no SimpleFOC. Direct MCU PWM only.");
  serial.print("pins=PA8,PA9,PA10 pwm=");
  serial.print(config::kPhaseCheckPwmDuty);
  serial.print(" hold_ms=");
  serial.println(config::kPhaseCheckHoldMs);
  serial.println("Sequence: PA8_A, PA9_B, PA10_C.");
  printState(serial, "boot");
}

void updatePhaseCheck(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kPhaseCheckEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      applySinglePhase(g_step_index % 3u);
      g_last_phase_change_ms = now;
    }
    printState(serial, drvReadyForPwm() ? "enable_applied" : "enable_failed");
  }

  if (g_driver_enabled && (now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 3u);
    applySinglePhase(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "phase_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    (void)drvReadAll();
    printState(serial, "periodic");
  }
}

void updatePhaseCheck6Pwm(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

