feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
  if (!g_driver_enabled && (now - g_boot_ms) >= config::kPhaseCheckEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      applySingleLeg6Pwm(g_step_index % 6u);
      g_last_phase_change_ms = now;
    }
    printState(serial, drvReadyForPwm() ? "enable_applied" : "enable_failed");
  }

  if (g_driver_enabled && (now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 6u);
    applySingleLeg6Pwm(g_step_index % 6u);
    g_last_phase_change_ms = now;
    printState(serial, "leg_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    (void)drvReadAll();
    printState(serial, "periodic");
  }
}

void updateRawCPins(Stream& serial) {
  const uint32_t now = millis();

  if (g_last_phase_change_ms == 0u) {
    g_last_phase_change_ms = now;
    analogWrite(config::kPwmCPin, config::kPhaseCheckPwmDuty);
    analogWrite(config::kPwmCLowPin, 0);
    printState(serial, "enable_applied");
  }

  if ((now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 2u);
    if ((g_step_index % 2u) == 0u) {
      analogWrite(config::kPwmCPin, config::kPhaseCheckPwmDuty);
      analogWrite(config::kPwmCLowPin, 0);
    } else {
      analogWrite(config::kPwmCPin, 0);
      analogWrite(config::kPwmCLowPin, config::kPhaseCheckPwmDuty);
    }
    g_last_phase_change_ms = now;
    printState(serial, "pin_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    printState(serial, "periodic");
  }
}

void updatePhaseCheck3Pwm(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kPhaseCheckEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      applySinglePhase(g_step_index % 3u);
      g_last_phase_change_ms = now;
    }
    printState(serial, drvReadyForPwm() ? "enable_applied" : "enable_failed");
  }

  if (g_driver_enabled && (now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 3u);
    applySinglePhase(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "phase_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    (void)drvReadAll();
    printState(serial, "periodic");
  }
}

void updateRaw3PwmPins(Stream& serial) {
  const uint32_t now = millis();

  if (g_last_phase_change_ms == 0u) {
    g_last_phase_change_ms = now;
    analogWrite(config::kPwmAPin, config::kPhaseCheckPwmDuty);
    analogWrite(config::kPwmBPin, 0);
    analogWrite(config::kPwmCPin, 0);
    printState(serial, "enable_applied");
  }

  if ((now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 3u);
    analogWrite(config::kPwmAPin, (g_step_index % 3u) == 0u ? config::kPhaseCheckPwmDuty : 0);
    analogWrite(config::kPwmBPin, (g_step_index % 3u) == 1u ? config::kPhaseCheckPwmDuty : 0);
    analogWrite(config::kPwmCPin, (g_step_index % 3u) == 2u ? config::kPhaseCheckPwmDuty : 0);
    g_last_phase_change_ms = now;
    printState(serial, "pin_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    printState(serial, "periodic");
  }
}

void updateDrvSpiStability(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint16_t prev_ctrl1 = g_drv.control1;
  const uint16_t prev_ctrl2 = g_drv.control2;
  const bool prev_match = g_drv.control_match;

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kDrvSpiStabilityEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_last_phase_change_ms = now;
    }
    printState(serial, drvReadyForPwm() ? "enable_applied" : "enable_failed");
  }

  if (g_driver_enabled && !g_drv_spi_stage_pwm &&
      (now - g_last_phase_change_ms) >= config::kDrvSpiStabilityNoPwmMs) {
    g_drv_spi_stage_pwm = true;
    g_step_index = 0;
    applySinglePhaseStability(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "pwm_stress_start");
  }

  if (g_driver_enabled && g_drv_spi_stage_pwm &&
      (now - g_last_phase_change_ms) >= config::kDrvSpiStabilityStepMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 3u);
    applySinglePhaseStability(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "phase_advance");
  }

  if ((now - g_last_print_ms) >= config::kDrvSpiStabilityStatusIntervalMs) {
    g_last_print_ms = now;
    (void)drvReadAll();
    if (g_drv.control1 != prev_ctrl1 || g_drv.control2 != prev_ctrl2 || g_drv.control_match != prev_match) {
      printState(serial, "reg_change");
    } else {
      printState(serial, "periodic");
    }
  }
}

void updateSimpleFocOpenloop(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint8_t hall = readHallState();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      g_motor.disable();
      g_driver3.disable();
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_openloop_started = false;
      g_openloop_enable_ms = 0;
      g_openloop_target_rad_s = 0.0f;
      g_openloop_move_called = false;
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    g_openloop_move_called = false;
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kSimpleFocEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_driver3.enable();
      g_motor.enable();
      g_openloop_started = true;
      g_openloop_enable_ms = now;
      g_openloop_last_good_drv_ms = now;
      g_last_hall_state = hall;
    } else {
      g_openloop_started = false;
    }
    printState(serial, g_openloop_started ? "enable_applied" : "enable_failed");
  }

  g_openloop_target_rad_s = rpmToRadPerSec(config::kSimpleFocOpenloopTargetRpm);
  g_openloop_move_called = false;

